{ 
    "content": [
    {
    "title": "Edsby",
    "description":
      "My main work for the past 11 years. The majority of the site and its graphics are designed and created by me, including all the UI of the application itself. Built on a Wordpress template with additional custom coded functionality.",
    "liveURL": "https://edsby.com",
    "tags": ["wordpress","html","design"]
  },
  {
    "title": "Joseph & Monique Wedding Website",
    "description":
      "A custom wedding website, includes custom RSVP collection form using the Google Sheets API to pull guest info from the Google Sheet, write it back to the doc, and send confirmation emails to the guests and the bride and groom.",
    "tags": ["html", "design","api","javascript","php"],
    "liveURL": "https://josephandmonique.com/ "
  }, 
  {
    "title": "Tweet2JPG",
    "description":
      "Small tool to pull tweet data using tweet ID. Primarily created for Edsby marketing team to facilitate easy tweet graphics for email newsletters",
    "tags": ["javascript","api"],
    "liveURL": "https://gobanana.ca/tweet2jpg/",
    "github": "https://github.com/gobanana66/Tweet2JPG"
  }, 
  {
    "title": "Notion Invoice Viewer",
    "description":
      "Using the Notion API to display a web interface of Invoices and select one to display and then print to PDF",
    "tags": ["javascript","api"],
    "github": "https://github.com/gobanana66/notion-invoice-viewer"
  }, 
  {
    "title": "Baby Pool",
    "description":
      "Baby pool tracker. Everyone enters their guesses which get input into a Google Sheet and then a winner is selected via a points system. Plus a cute little pure css penguin loader animation for extra whimsy.",
    "tags": ["javascript","api","html"],
    "liveURL": "https://gobanana.ca/babyrider/"
  }, 
  {
    "title": "SharkBot",
    "description":
      "Custom discord bot with autoresponder and a Leslie Knope compliment generator command",
    "tags": ["javascript","api"],
    "github": "https://github.com/gobanana66/SharkBot"
  }, 
  {
    "title": "Paul & Jessica Wedding Website",
    "description":
      "A custom lightweight wedding website, all illustrations and lettering are custom-made, also includes parallax animations.",
    "tags": ["html", "design"],
    "liveURL": "https://gobanana.ca/paulandjessica/"
  }, 
  {
    "title": "Age of Lapin",
    "description":
      "A completely from scratch designed brand identity and website for new age wellness. Includes a blog, a horoscope feed api, community events submissions, and a curated product section.",
    "tags": ["wordpress", "design","api"],
    "liveURL": "https://ageoflapin.com/"
  }, 
  {
    "title": "EY Entrepreneur of the Year",
    "description":
      "A single page microsite for EOY winners. Built on Wordpress.",
    "tags": ["wordpress"],
    "liveURL": "https://eoy.mediaonecreative.ca/"
  }

]
}